[
    {
        "index": 0,
        "header": "Why I created this blog",
        "subheader": "First brick",
        "body": "<p><span>Why I started writing blog you asked? Short answer is, I am not sure either. However, let me walk you through my though process. This way I might be able find it out for myself as well.</span></p><p><span>&nbsp;Let me start by telling you a bit about myself. If I want to describe myself I would say that I am a (relatively) young man with an obsessive mind set. Let me elaborate. I can divide my life info different cycles. Each cycle consists of, finding a new thing, obsessing bout it , submerging my self in it, loosing interest and put it on back burner and coming back to it once in a while. 15 years ago I was really into photography, I was constantly taking photos, mostly street photography. I was spending all my spare time reading photography magazines and editing photos and learning new techniques and finding new gears. Then some changes in my career and studies push me away from photography toward programming. At this point I was fixing bugs in my dream and writing code in my head on the toilette, and it pays off. I am a professional programmer now. <br /></span></p><p><span>As you may think I is not a healthy mind set. But what is my obsessive behavior has to do with this blog. Well the thing is, long time ago when I was young and idealist I really wanted to write, and I did write. If I read you what I wrote when I was 20 it would be so cringe worthy and I am NOT going to do that! But I want to try again. But this time I do not want not write some cheesy poetic nonsense that no body wants. This time I want to write about the things that interests me and document what I learned. This way I have a place to go back and see what happened to me and how did I grow as a person, and also other people might also benefit from it (or not, who cares)</span></p><p><span>&nbsp;</span></p><p><span>I hope you find it interesting.</span></p><p><span>cheers. <br /></span></p><p><br /></p>",
        "date": "2021-06-17"
    },
    {
        "index": 1,
        "header": "What COVID taught me!",
        "subheader": "",
        "body": "<p>As I lay writing this, we are 1.5 years into COVID-19 ordeal. Some of us lost some loved ones including myself, some lost their jobs or homes. I believe this was the toughest hurdle in my life that I went through and not necessarily came out on top, and that is OK.</p><p>In the beginning everything had a fog of uncertainty to it. I had a lot of questions that I naively believed I knew the answer for, and the more we sank into this boring version of movies about pandemic deadly diseases, the more clear it got that nobody agrees on a single fact about COVID-19. Some people oppose wearing mask, some wearing two masks and a shield. Some studies said you need to wash all the groceries and the other said it is not necessary. At our home we still disinfect everything that comes in the house one way or another. We were following the news like it was a exciting but doomed lottery draw. News about the death toll and number of new cases everyday. Everyone were praising Japan and Korea for the way they handled the pandemy.</p><p>Couple of months passed and it was clear that we are in it for a long time. everybody scrambling to make the most of it. From learning new skills or to binge watching Game of Thrones or Breaking Bad, the reactions were very divers. I personally started doing linoleum printing. It was (is) very liberating and fun, and also lots and lots of pet projects. I tried building a home server with my Raspberry PI, I wrote a handful of unfinished software, I stared some online courses. Although I did not finish any of them to their natural completion point, I learned a new thing from each of them. Now I know myself a bit better. i am not happy with what I understood but I am not disappointed either.</p><p>This ordeal will as well be gone like any other thing. That is the single common thread among all THINGS. Everything has an end. Biggest mistake is to think that what we have will last for ever. One thing that I learned the hard way during this stay at home vacation is that what we built is a house of cards and it will implode with a slightest gust of wind.<br /></p>",
        "date": "2021-07-26"
    },
    {
        "index": 2,
        "header": "\"The Laughing Song\" but only for the Shah!",
        "subheader": "",
        "body": "<p>Recently I discovered a very interesting website called <a href='https://publicdomainreview.org'>Public Domain Review</a> while listening to <a href='https://www.nosuchthingasafish.com/'>no such thing as a fish</a> - which is a one of my favorite podcasts. I was scouring through the website when I found this piece of strange history. This is a \"Recording by the Norwegian actor Henry Klauser, a mournful refrain gradually gives way to laughter. According to The Incredible Music Machine (1982), the record found a perhaps unlikely fan in the form of the fifth Qajar king of Persia, Mozaffar ad-Din Shah Qajar.\"</p><div class='h-center'><img src='https://the-public-domain-review.imgix.net/collections/the-laughing-song-1904/hqdefault.jpg?w=251' data-blursrc='https://the-public-domain-review.imgix.net/collections/the-laughing-song-1904/hqdefault.jpg?w=251&amp;blur=1500&amp;q=20' data-src='https://the-public-domain-review.imgix.net/collections/the-laughing-song-1904/hqdefault.jpg?w=251' class='undefined'><iframe src='https://archive.org/embed/78_laughing-song-especialidad-de-risas-especialidade-de-risos_henry-klausen-klause_gbia0022603b' webkitallowfullscreen='true' mozallowfullscreen='true' allowfullscreen='' width='500' height='40' frameborder='0'></iframe></div><p>In this novelty recording by the Norwegian actor Henry Klauser, a mournful refrain gradually gives way to laughter. According to The Incredible Music Machine (1982), the record found a perhaps unlikely fan in the form of the fifth Qajar king of Persia, Mozaffar ad-Din Shah Qajar.</p><div><blockquote>The Shah became a great fan of the gramophone. Later that year, he asked [Gramophone] Company representative E.W. Emmerson to bring some of the latest records to the Palace. One of them was the famous \"Laughing Song\" by Henry Klauser, and Emmerson reported that the Shah laughed out loud when it was played. He added: \"The contortions on the faces of his people, who are not supposed to laugh in his presence, baffled description.\"</blockquote></div>",
        "date": "2021-10-23"
    }
]
