[
    {
        "index": 0,
        "header": "Why I created this blog",
        "subheader": "First brick",
        "body": "<p><span>Why I started writing blog you asked? Short answer is, I am not sure either. However, let me walk you through my though process. This way I might be able find it out for myself as well.</span></p><p><span>&nbsp;Let me start by telling you a bit about myself. If I want to describe myself I would say that I am a (relatively) young man with an obsessive mind set. Let me elaborate. I can divide my life info different cycles. Each cycle consists of, finding a new thing, obsessing bout it , submerging my self in it, loosing interest and put it on back burner and coming back to it once in a while. 15 years ago I was really into photography, I was constantly taking photos, mostly street photography. I was spending all my spare time reading photography magazines and editing photos and learning new techniques and finding new gears. Then some changes in my career and studies push me away from photography toward programming. At this point I was fixing bugs in my dream and writing code in my head on the toilette, and it pays off. I am a professional programmer now. <br /></span></p><p><span>As you may think I is not a healthy mind set. But what is my obsessive behavior has to do with this blog. Well the thing is, long time ago when I was young and idealist I really wanted to write, and I did write. If I read you what I wrote when I was 20 it would be so cringe worthy and I am NOT going to do that! But I want to try again. But this time I do not want not write some cheesy poetic nonsense that no body wants. This time I want to write about the things that interests me and document what I learned. This way I have a place to go back and see what happened to me and how did I grow as a person, and also other people might also benefit from it (or not, who cares)</span></p><p><span>&nbsp;</span></p><p><span>I hope you find it interesting.</span></p><p><span>cheers. <br /></span></p><p><br /></p>",
        "date": "2021-06-17"
    }
]